src/DataProcessors/УдалениеДублейИзТЧПоставщики/УдалениеДублейИзТЧПоставщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УдалениеДублейИзТЧПоставщики</name>
</mdclass:DataProcessor>

src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/УдалениеДублейИзТЧПоставщики/Forms/Форма/Module.bsl
//////////////////////////// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ //////////////
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УдалитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
 	Возврат ОбработкаОбъект.УдалитьДублиНаСервере(Истина)
КонецФункции

&НаСервере
Процедура СформироватьНеобработанныеПС()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка КАК ПС
		|ИЗ
		|	Справочник.КаталогПредметовСнабжения.ИзготовителиИПоставщики КАК КаталогПредметовСнабженияИзготовителиИПоставщики
		|ГДЕ
		|	НЕ КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(КаталогПредметовСнабженияИзготовителиИПоставщики.Контрагент) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КаталогПредметовСнабженияИзготовителиИПоставщики.Контрагент)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПС";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоВсего = РезультатЗапроса.Количество();
	
	СписокПС.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура СписокПСПриАктивизацииСтрокиНаСервере(ТекущийПС)
	ТЧПоставщики.Загрузить(ТекущийПС.ИзготовителиИПоставщики.Выгрузить());	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере(ТекущийПС)
	ПСОбъект = ТекущийПС.ПолучитьОбъект();
	ПСОбъект.ИзготовителиИПоставщики.Загрузить(ТЧПоставщики.Выгрузить());
	ПСОбъект.Записать();
КонецПроцедуры

#КонецОбласти
/////////////////////////////////////////////////////////////////////////

//////////////////////////// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ //////////////////
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокПСПриАктивизацииСтроки(Элемент)
	Если СписокПС.Количество() > 0 Тогда
		ТекущийПС = Элементы.СписокПС.ТекущиеДанные.ПС;
		СписокПСПриАктивизацииСтрокиНаСервере(ТекущийПС);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
/////////////////////////////////////////////////////////////////////////

/////////////////////////////////////// КОМАНДЫ ФОРМЫ ///////////////////
#Область КомандыФормы

&НаКлиенте
Процедура СформиватьСписокПС(Команда)
	СформироватьНеобработанныеПС();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубли(Команда)
	Структура = УдалитьНаСервере();
	Если Структура.Свойство("ФоновоеЗаданиеУжеЗапущено") Тогда
		Сообщить("Запущено фоновое задание по удалению дублей");
		Возврат;
	КонецЕсли;
	Сообщить("Обработано элементов " + Структура.КоличествоОбработанныхЭлементов);
	СформироватьНеобработанныеПС();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	ТекущийПС = Элементы.СписокПС.ТекущиеДанные.ПС;
	СохранитьИзмененияНаСервере(ТекущийПС);
КонецПроцедуры

#КонецОбласти
/////////////////////////////////////////////////////////////////////////
